In [1]:
#pandas important
#series - 1-D
#Dataframe - 2-D
#panel

In [2]:
import pandas as pd
import numpy as np

In [3]:
names = ["Sachin","Yuvraj","Dhoni"]

In [5]:
s = pd.Series(names)

In [6]:
s

0    Sachin
1    Yuvraj
2     Dhoni
dtype: object

In [7]:
s[0]

'Sachin'

In [9]:
scores = [100,200,None]

In [10]:
avg = [49.57,None,39.87]

In [12]:
dataset = {
    "names" : names,
    "scores" : scores,
    "avg" : avg

}

In [14]:
y = pd.DataFrame(dataset)

In [15]:
y.shape #returns the dimension of the table

(3, 3)

In [16]:
y.head() #returns the table of first five rows

    names  scores    avg
0  Sachin   100.0  49.57
1  Yuvraj   200.0    NaN
2   Dhoni     NaN  39.87

In [17]:
y.tail() #returns the table of last five rows

    names  scores    avg
0  Sachin   100.0  49.57
1  Yuvraj   200.0    NaN
2   Dhoni     NaN  39.87

In [18]:
y.describe()

           scores        avg
count    2.000000   2.000000
mean   150.000000  44.720000
std     70.710678   6.858936
min    100.000000  39.870000
25%    125.000000  42.295000
50%    150.000000  44.720000
75%    175.000000  47.145000
max    200.000000  49.570000

In [19]:
#std - standard deviation -consistency

In [24]:
y['names'].head()

0    Sachin
1    Yuvraj
2     Dhoni
Name: names, dtype: object

In [27]:
y[y['scores']>40]

    names  scores    avg
0  Sachin   100.0  49.57
1  Yuvraj   200.0    NaN

In [30]:
y.isna() #returns the table of boolean values representing Nan values

   names  scores    avg
0  False   False  False
1  False   False   True
2  False    True  False

In [31]:
y.dropna() #drop those rows with Nan values

    names  scores    avg
0  Sachin   100.0  49.57

In [38]:
y.fillna(0)

    names  scores    avg
0  Sachin   100.0  49.57
1  Yuvraj   200.0   0.00
2   Dhoni     0.0  39.87